
  <details>
  <summary>terraform/container-instance - Terraform Plan Output (click to expand)</summary>
  
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 0s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]
data.oci_identity_availability_domains.local_ads: Reading...
data.oci_identity_availability_domains.local_ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-2588219643]
oci_container_instances_container_instance.demo_container_instance: Refreshing state... [id=ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaacilpcqakw7dtvlzeoni2hbccg44g3mwb5y4uefeob7ua]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # oci_container_instances_container_instance.demo_container_instance must be replaced
-/+ resource "oci_container_instances_container_instance" "demo_container_instance" {
      ~ container_count                      = 3 -> (known after apply)
      ~ defined_tags                         = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
          - "Oracle-Tags.CreatedOn" = "2024-07-15T13:51:20.822Z"
        } -> (known after apply)
      + fault_domain                         = (known after apply)
      ~ graceful_shutdown_timeout_in_seconds = "0" -> (known after apply)
      ~ id                                   = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaacilpcqakw7dtvlzeoni2hbccg44g3mwb5y4uefeob7ua" -> (known after apply)
      ~ lifecycle_details                    = "Active" -> (known after apply)
      ~ state                                = "ACTIVE" -> (known after apply)
      ~ system_tags                          = {} -> (known after apply)
      ~ time_created                         = "2024-07-15 13:51:21.547 +0000 UTC" -> (known after apply)
      ~ time_updated                         = "2024-07-15 13:52:29.218 +0000 UTC" -> (known after apply)
      ~ volume_count                         = 0 -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ containers {
          ~ arguments                      = [ # forces replacement
              ~ "--listen-address=${var.private_ip}" -> "--listen-address=10.0.1.77",
              ~ "--rpc-address=${var.private_ip}" -> "--rpc-address=10.0.1.77",
              ~ "--seed-provider-parameters seeds=${var.private_ip}" -> "--seed-provider-parameters seeds=10.0.1.77",
              ~ "--alternator-address=${var.private_ip}" -> "--alternator-address=10.0.1.77",
                "--alternator-port=8000",
                # (1 unchanged element hidden)
            ]
          ~ availability_domain            = "CwAQ:eu-amsterdam-1-AD-1" -> (known after apply)
          ~ command                        = [] -> (known after apply)
          ~ compartment_id                 = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q" -> (known after apply)
          ~ container_id                   = "ocid1.computecontainer.oc1.eu-amsterdam-1.anqw2ljr343laxaacbeyh6crrfpjzpzenureoy7fmajicthcyrz3cgmctk2a" -> (known after apply)
          ~ container_instance_id          = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaacilpcqakw7dtvlzeoni2hbccg44g3mwb5y4uefeob7ua" -> (known after apply)
          ~ defined_tags                   = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T13:51:20.822Z"
            } -> (known after apply)
          ~ environment_variables          = {} -> (known after apply)
          ~ exit_code                      = 0 -> (known after apply)
          + fault_domain                   = (known after apply)
          ~ freeform_tags                  = {
              - "project-name" = "scylladb"
            } -> (known after apply)
          ~ is_resource_principal_disabled = false -> (known after apply)
          ~ lifecycle_details              = "CONTAINER_RUNNING" -> (known after apply)
          ~ state                          = "ACTIVE" -> (known after apply)
          ~ system_tags                    = {} -> (known after apply)
          ~ time_created                   = "2024-07-15 13:51:21.4 +0000 UTC" -> (known after apply)
          + time_terminated                = (known after apply)
          ~ time_updated                   = "2024-07-15 13:52:29.275 +0000 UTC" -> (known after apply)
          + working_directory              = (known after apply)
            # (2 unchanged attributes hidden)

          ~ resource_config {
              + memory_limit_in_gbs = (known after apply)
              + vcpus_limit         = (known after apply)
            }

          - security_context {
              - is_non_root_user_check_enabled = false -> null
              - is_root_file_system_readonly   = false -> null
              - run_as_group                   = 0 -> null
              - run_as_user                    = 0 -> null
              - security_context_type          = "LINUX" -> null
            }
        }
      ~ containers {
          ~ arguments                      = [ # forces replacement
              ~ "sleep 60 | echo loading cassandra keyspace | cqlsh ${var.private_ip} -u cassandra -p cassandra -e \\\"INSERT INTO system_auth.roles (role,can_login,is_superuser,member_of,salted_hash) VALUES ('$AWS_ACCESS_KEY_ID',True,False,null,'$AWS_SECRET_ACCESS_KEY');\\\"" -> "sleep 60 | echo loading cassandra keyspace | cqlsh 10.0.1.77 -u cassandra -p cassandra -e \"INSERT INTO system_auth.roles (role,can_login,is_superuser,member_of,salted_hash) VALUES ('$AWS_ACCESS_KEY_ID',True,False,null,'$AWS_SECRET_ACCESS_KEY');\"",
            ]
          ~ availability_domain            = "CwAQ:eu-amsterdam-1-AD-1" -> (known after apply)
          ~ compartment_id                 = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q" -> (known after apply)
          ~ container_id                   = "ocid1.computecontainer.oc1.eu-amsterdam-1.anqw2ljr343laxaapgyxk7wy7446shdscx47dhccert47fhygiu2k5lmvs7q" -> (known after apply)
          ~ container_instance_id          = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaacilpcqakw7dtvlzeoni2hbccg44g3mwb5y4uefeob7ua" -> (known after apply)
          ~ defined_tags                   = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T13:51:20.822Z"
            } -> (known after apply)
          ~ environment_variables          = {} -> (known after apply)
          ~ exit_code                      = 2 -> (known after apply)
          + fault_domain                   = (known after apply)
          ~ freeform_tags                  = {
              - "project-name" = "scylladb"
            } -> (known after apply)
          ~ is_resource_principal_disabled = false -> (known after apply)
          ~ lifecycle_details              = "CONTAINER_TERMINATED" -> (known after apply)
          ~ state                          = "ACTIVE" -> (known after apply)
          ~ system_tags                    = {} -> (known after apply)
          ~ time_created                   = "2024-07-15 13:51:21.442 +0000 UTC" -> (known after apply)
          + time_terminated                = (known after apply)
          ~ time_updated                   = "2024-07-15 13:52:29.266 +0000 UTC" -> (known after apply)
          + working_directory              = (known after apply)
            # (3 unchanged attributes hidden)

          ~ resource_config {
              + memory_limit_in_gbs = (known after apply)
              + vcpus_limit         = (known after apply)
            }

          - security_context {
              - is_non_root_user_check_enabled = false -> null
              - is_root_file_system_readonly   = false -> null
              - run_as_group                   = 0 -> null
              - run_as_user                    = 0 -> null
              - security_context_type          = "LINUX" -> null
            }
        }
      ~ containers {
          ~ arguments                      = [ # forces replacement
              ~ "sleep 70 | aws dynamodb create-table --table-name $TABLE_NAME --attribute-definitions AttributeName=LockID,AttributeType=S --key-schema AttributeName=LockID,KeyType=HASH --billing-mode=PAY_PER_REQUEST --region 'None' --endpoint-url=http://${var.private_ip}:8000" -> "sleep 70 | aws dynamodb create-table --table-name s3-state-locks --attribute-definitions AttributeName=LockID,AttributeType=S --key-schema AttributeName=LockID,KeyType=HASH --billing-mode=PAY_PER_REQUEST --region 'None' --endpoint-url=http://10.0.1.77:8000",
            ]
          ~ availability_domain            = "CwAQ:eu-amsterdam-1-AD-1" -> (known after apply)
          ~ compartment_id                 = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q" -> (known after apply)
          ~ container_id                   = "ocid1.computecontainer.oc1.eu-amsterdam-1.anqw2ljr343laxaaoecv7h3cuep7h5ctniazwgfm7zh5jdbfor4ecftlcnea" -> (known after apply)
          ~ container_instance_id          = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaacilpcqakw7dtvlzeoni2hbccg44g3mwb5y4uefeob7ua" -> (known after apply)
          ~ defined_tags                   = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T13:51:20.822Z"
            } -> (known after apply)
          ~ environment_variables          = {} -> (known after apply)
          ~ exit_code                      = 0 -> (known after apply)
          + fault_domain                   = (known after apply)
          ~ freeform_tags                  = {
              - "project-name" = "scylladb"
            } -> (known after apply)
          ~ is_resource_principal_disabled = false -> (known after apply)
          ~ lifecycle_details              = "CONTAINER_RUNNING" -> (known after apply)
          ~ state                          = "ACTIVE" -> (known after apply)
          ~ system_tags                    = {} -> (known after apply)
          ~ time_created                   = "2024-07-15 13:51:21.487 +0000 UTC" -> (known after apply)
          + time_terminated                = (known after apply)
          ~ time_updated                   = "2024-07-15 13:52:29.256 +0000 UTC" -> (known after apply)
          + working_directory              = (known after apply)
            # (3 unchanged attributes hidden)

          ~ resource_config {
              + memory_limit_in_gbs = (known after apply)
              + vcpus_limit         = (known after apply)
            }

          - security_context {
              - is_non_root_user_check_enabled = false -> null
              - is_root_file_system_readonly   = false -> null
              - run_as_group                   = 0 -> null
              - run_as_user                    = 0 -> null
              - security_context_type          = "LINUX" -> null
            }
        }

      ~ shape_config {
          ~ networking_bandwidth_in_gbps = 1000 -> (known after apply)
          ~ processor_description        = "3.0 GHz Ampere® Altra™" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ vnics {
          ~ defined_tags           = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T13:51:26.700Z"
            } -> (known after apply)
          ~ freeform_tags          = {} -> (known after apply)
          ~ nsg_ids                = [] -> (known after apply)
          ~ vnic_id                = "ocid1.vnic.oc1.eu-amsterdam-1.abqw2ljrogktmarq6dk7vwbdtu3wmicwixhdlmspeo33zqtilhw3vn2fbrhq" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
